#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/ambrosia-serve-k8s/ambrosia-serve-k8s/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/ambrosia-serve-k8s/ambrosia-serve-k8s

To view this run in a browser, visit:
https://app.terraform.io/app/ambrosia-serve/postech-workspace/runs/run-rNZULWEux5q39Y8T

Waiting for the plan to start...

Terraform v1.10.1
on linux_amd64
Initializing plugins and modules...
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-rNZULWEux5q39Y8T/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-rNZULWEux5q39Y8T/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_access_entry.eks_access_entry will be created
  + resource "aws_eks_access_entry" "eks_access_entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "ambrosia-serve-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "group-1",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::851725225519:role/LabRole"
      + tags_all          = {
          + "Environment" = "Production"
          + "Owner"       = "Grupo-40"
          + "Project"     = "Ambrosia Serve"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.example will be created
  + resource "aws_eks_access_policy_association" "example" {
      + associated_at = (known after apply)
      + cluster_name  = "ambrosia-serve-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::851725225519:role/LabRole"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.cluster will be created
  + resource "aws_eks_cluster" "cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "ambrosia-serve-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::851725225519:role/LabRole"
      + status                        = (known after apply)
      + tags_all                      = {
          + "Environment" = "Production"
          + "Owner"       = "Grupo-40"
          + "Project"     = "Ambrosia Serve"
        }
      + version                       = "1.31"

      + access_config {
          + authentication_mode = "API"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-09260901517fbc8f7",
              + "subnet-0bb9852652d96a262",
              + "subnet-0f137534666122cec",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node_group will be created
  + resource "aws_eks_node_group" "node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "ambrosia-serve-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "ambrosia-serve-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::851725225519:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-09260901517fbc8f7",
          + "subnet-0bb9852652d96a262",
          + "subnet-0f137534666122cec",
        ]
      + tags_all               = {
          + "Environment" = "Production"
          + "Owner"       = "Grupo-40"
          + "Project"     = "Ambrosia Serve"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRole",
                          + "sts:TagSession",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-example"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "Production"
          + "Owner"       = "Grupo-40"
          + "Project"     = "Ambrosia Serve"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-example"
    }

  # aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP port 8000 and all outbound traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ambrosia-serve-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ambrosia-serve-sg"
        }
      + tags_all               = {
          + "Environment" = "Production"
          + "Name"        = "ambrosia-serve-sg"
          + "Owner"       = "Grupo-40"
          + "Project"     = "Ambrosia Serve"
        }
      + vpc_id                 = "vpc-01525f58b2e30df1b"
    }

  # aws_vpc_security_group_egress_rule.allow_all_traffic_ipv4 will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_all_traffic_ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "Production"
          + "Owner"       = "Grupo-40"
          + "Project"     = "Ambrosia Serve"
        }
    }

  # aws_vpc_security_group_egress_rule.allow_all_traffic_ipv6 will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_all_traffic_ipv6" {
      + arn                    = (known after apply)
      + cidr_ipv6              = "::/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "Production"
          + "Owner"       = "Grupo-40"
          + "Project"     = "Ambrosia Serve"
        }
    }

  # aws_vpc_security_group_ingress_rule.allow_http_ipv4_8000 will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_http_ipv4_8000" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "Production"
          + "Owner"       = "Grupo-40"
          + "Project"     = "Ambrosia Serve"
        }
      + to_port                = 80
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_endpoint = (known after apply)
  + cluster_name     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @felixrodrigo19, Action: `pull_request`, Working Directory: ``, Workflow: `CI - Infra`*